<a href="https://colab.research.google.com/github/Asoke26/Algorithms/blob/master/sql_generator.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



*   Generate random INSERT statements to populate an empty database
*   Generate SELECT queries and their cardinalities for a given population of tuples
<center>
<img src="https://raw.githubusercontent.com/Btsan/personal/master/Picture1.png">
<br>
<b>Figure: </b>
<i>The database schema for populating. Table_A contains PersonID, Birthyear, and Region attributes. Table_B contains PersonID, Name, and Age attributes.</i>
</center>

In [0]:
import sqlite3
import random

In [0]:
# function: given parameters to control the number of rows per table
#           outputs a list of SQL inserts

def gen_inserts(num_rows=50, mean_birthyear=1990, regions=None, names=None, current_year=2020):
  if regions is None:
    regions = ["NA", "SA", "EU", "AF", "AS", "OC"]
  if names is None:
    names = ["John", "Mary"]

  inserts = []
  for i in range(num_rows):
    byear = int(random.gauss(mean_birthyear, 20))
    region = random.choice(regions)
    name = random.choice(names)
    age = current_year - byear
    s1 = "INSERT INTO Table_A VALUES (" + str(i) + ", " + str(byear) + ", '" + region + "');"
    s2 = "INSERT INTO Table_B VALUES (" + str(i) + ", '" + name + "', " + str(age) + ");"
    inserts.append(s1)
    inserts.append(s2)
  return inserts

In [0]:
# test insert generation

inserts = gen_inserts(10)
for ins in inserts:
  print(ins)

INSERT INTO Table_A VALUES (0, 2026, 'OC');
INSERT INTO Table_B VALUES (0, 'Mary', -6);
INSERT INTO Table_A VALUES (1, 1974, 'NA');
INSERT INTO Table_B VALUES (1, 'Mary', 46);
INSERT INTO Table_A VALUES (2, 1973, 'OC');
INSERT INTO Table_B VALUES (2, 'John', 47);
INSERT INTO Table_A VALUES (3, 1989, 'NA');
INSERT INTO Table_B VALUES (3, 'John', 31);
INSERT INTO Table_A VALUES (4, 1987, 'AS');
INSERT INTO Table_B VALUES (4, 'John', 33);
INSERT INTO Table_A VALUES (5, 1994, 'OC');
INSERT INTO Table_B VALUES (5, 'Mary', 26);
INSERT INTO Table_A VALUES (6, 1974, 'AS');
INSERT INTO Table_B VALUES (6, 'Mary', 46);
INSERT INTO Table_A VALUES (7, 1999, 'SA');
INSERT INTO Table_B VALUES (7, 'John', 21);
INSERT INTO Table_A VALUES (8, 1948, 'SA');
INSERT INTO Table_B VALUES (8, 'John', 72);
INSERT INTO Table_A VALUES (9, 1991, 'EU');
INSERT INTO Table_B VALUES (9, 'Mary', 29);

In [0]:
# function: given a number of queries to generate and distribution parameters,
#           outputs a list of SQL Select queries

# returns list of queries with the formats: 
# a) SELECT * FROM Table_A WHERE conditions
# b) SELECT * FROM Table_B WHERE conditions
# c) SELECT * FROM Table_A JOIN Table_B ON Table_A.PersonID=TableB.PersonID WHERE conditions 
def gen_queries(num_queries=10, mean_birthyear=1990, regions=None, names=None, current_year=2020):
  if regions is None:
    regions = ["NA", "SA", "EU", "AF", "AS", "OC"]
  if names is None:
    names = ["John", "Mary"]

  queries = []
  counts = []

  for i in range(num_queries):
    query_format = random.choice(['a', 'b', 'c'])
    if query_format is 'a':
      q = "SELECT COUNT(*) FROM Table_B"
      cond1 = random.choice([True, False])
      cond2 = random.choice([True, False])
      if cond1:
        op = random.choice(['=', '>', '<'])
        year = int(random.gauss(mean_birthyear, 20))
        q = q + " WHERE Birthyear" + op + str(year)
      if cond2:
        if cond1:
          q = q + " AND"
        else:
          q = q + " WHERE"
        region = random.choice(regions)
        q = q + " Region='" + region + "'"
      q = q + ";"
      queries.append(q)
    
    elif query_format is 'b':
      q = "SELECT COUNT(*) FROM Table_B"
      cond1 = random.choice([True, False])
      cond2 = random.choice([True, False])
      if cond1:
        name = random.choice(names)
        q = q + " WHERE Name='" + name + "'"
      if cond2:
        if cond1:
          q = q + " AND"
        else:
          q = q + " WHERE"
        op = random.choice(['=', '>', '<'])
        age = current_year - int(random.gauss(mean_birthyear, 20))
        q = q + " Age" + op + str(age)
      q = q + ";"
      queries.append(q)

    else:
      q = "SELECT COUNT(*) FROM Table_A JOIN Table_B ON Table_A.PersonID=Table_B.PersonId"
      cond1 = random.choice([True, False])
      cond2 = random.choice([True, False])
      cond3 = random.choice([True, False])
      cond4 = random.choice([True, False])
      if cond1:
        op = random.choice(['=', '>', '<'])
        year = int(random.gauss(mean_birthyear, 20))
        q = q + " WHERE Birthyear" + op + str(year)
      if cond2:
        if cond1:
          q = q + " AND"
        else:
          q = q + " WHERE"
        region = random.choice(regions)
        q = q + " Region='" + region + "'"
      if cond3:
        if cond1 or cond2:
          q = q + " AND"
        else:
          q = q + " WHERE"
        name = random.choice(names)
        q = q + " Name='" + name + "'"
      if cond4:
        if cond1 or cond2 or cond3:
          q = q + " AND"
        else:
          q = q + " WHERE"
        op = random.choice(['=', '>', '<'])
        age = current_year - int(random.gauss(mean_birthyear, 20))
        q = q + " Age" + op + str(age)
      queries.append(q)
  return queries

In [0]:
# test query generation

queries = gen_queries(10)
for q in queries:
  print(q)

SELECT COUNT(*) FROM Table_B WHERE Name='John' AND Age<47;
SELECT COUNT(*) FROM Table_B WHERE Name='John';
SELECT COUNT(*) FROM Table_B;
SELECT COUNT(*) FROM Table_A JOIN Table_B ON Table_A.PersonID=Table_B.PersonId WHERE Region='OC' AND Age=8
SELECT COUNT(*) FROM Table_A JOIN Table_B ON Table_A.PersonID=Table_B.PersonId WHERE Region='AF' AND Name='John'
SELECT COUNT(*) FROM Table_B WHERE Name='Mary';
SELECT COUNT(*) FROM Table_A JOIN Table_B ON Table_A.PersonID=Table_B.PersonId WHERE Birthyear>1973 AND Region='EU' AND Name='Mary'
SELECT COUNT(*) FROM Table_B WHERE Name='John';
SELECT COUNT(*) FROM Table_A JOIN Table_B ON Table_A.PersonID=Table_B.PersonId WHERE Birthyear=1963 AND Region='AS'
SELECT COUNT(*) FROM Table_B WHERE Name='John';

In [0]:
# function: given an input list of SQL inserts and SQL COUNT queries,
#           initialize and construct a database from those statements,
#           run given queries on that database,
#           outputs a list of cardinalities per COUNT query

def run_queries(inserts, queries):
  connection = sqlite3.connect("sqlite.db")
  crsr = connection.cursor()

  crsr.execute("CREATE TABLE Table_A (PersonID int, Birthyear int, Region varchar(255));")
  crsr.execute("CREATE TABLE Table_B (PersonID int, Name varchar(255), Age int);")
  connection.commit()
  
  for ins in inserts:
    crsr.execute(ins)
  connection.commit()

  counts = []

  for q in queries:
    crsr.execute(q)
    ans =  crsr.fetchall()
    counts.append(ans)

  crsr.execute("DROP TABLE Table_A;")
  crsr.execute("DROP TABLE Table_B;")
  connection.commit()
  connection.close()
  return counts

In [0]:
# test running queries in sqlite

counts = run_queries(inserts, queries)

for c in counts:
  print(c)

[(3,)]
[(5,)]
[(10,)]
[(0,)]
[(0,)]
[(5,)]
[(1,)]
[(5,)]
[(0,)]
[(5,)]

Each word (or token) in a SQL statement will be embedded in a single 72-dimensional vector for input to the model.

<center>
<img src="https://raw.githubusercontent.com/Btsan/personal/master/Picture2.png">
<b>Figure:</b>
<i>SQL Keywords and operators are one-hot encoded. Database objects, such as tables and their attributes are multi-hot encoded. Strings are hashed by their character content. Numerical values are normalized by the mean of their respective attribute. The final embedded vector is the concatenation of all these features, so it will be considerably sparse.</i>
</center>